load-test-results/2025-06-08_test_1/20250608_161448_gateway_post_json.txt
Running 30s test @ http://localhost:3000/json
  4 threads and 25 connections
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 415
Response body: Expected request with `Content-Type: application/json`
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429Unexpected status: 429

Response body: Too Many Requests
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
Unexpected status: 429
Response body: Too Many Requests
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   215.52ms  289.69ms   1.90s    90.23%
    Req/Sec    15.68     12.63    50.00     71.93%
  224 requests in 30.04s, 28.52KB read
  Socket errors: connect 0, read 0, write 0, timeout 50
  Non-2xx or 3xx responses: 224
Requests/sec:      7.46
Transfer/sec:      0.95KB